In [57]:
import pandas as pd


#now we gonna clean the primary education dataset
primary_raw=pd.read_csv('../data/primary.csv')
primary_raw.head()

,Reference Area,Time Period,Sex,Age group,Units of measurement,Observation Value
0,Afghanistan,2014,All genders,Not applicable,Number,6217756.0
1,Afghanistan,2014,Female,Not applicable,Number,2484471.0
2,Afghanistan,2013,Female,Not applicable,Number,2401135.0
3,Afghanistan,2013,All genders,Not applicable,Number,5986268.0
4,Afghanistan,2012,All genders,Not applicable,Number,5767543.0

In [58]:
print(primary_raw.shape)
print(primary_raw.columns)
primary_raw.info()

(5556, 6)
Index(['Reference Area', 'Time Period', 'Sex', 'Age group',
       'Units of measurement', 'Observation Value'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5556 entries, 0 to 5555
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Reference Area        5556 non-null   object
 1   Time Period           5556 non-null   int64
 2   Sex                   5556 non-null   object
 3   Age group             5556 non-null   object
 4   Units of measurement  5556 non-null   object
 5   Observation Value     5556 non-null   float64
dtypes: float64(1), int64(1), object(4)
memory usage: 260.6+ KB

In [59]:
primary=primary_raw.copy()
# rename columns so that we have same columns so we can join them to create a combined dataset
primary=primary.rename(columns={"Reference Area": "Country","Time Period":"Year","Observation Value":"Value"})

primary.head()

,Country,Year,Sex,Age group,Units of measurement,Value
0,Afghanistan,2014,All genders,Not applicable,Number,6217756.0
1,Afghanistan,2014,Female,Not applicable,Number,2484471.0
2,Afghanistan,2013,Female,Not applicable,Number,2401135.0
3,Afghanistan,2013,All genders,Not applicable,Number,5986268.0
4,Afghanistan,2012,All genders,Not applicable,Number,5767543.0

In [60]:
#converting to numbers if they are strings or something else
primary["Year"]=pd.to_numeric(primary["Year"],errors="coerce")
primary["Value"]=pd.to_numeric(primary["Value"],errors="coerce")

primary["Units of measurement"].unique() # age group is also same ,so we can drop them
primary.head()

,Country,Year,Sex,Age group,Units of measurement,Value
0,Afghanistan,2014,All genders,Not applicable,Number,6217756.0
1,Afghanistan,2014,Female,Not applicable,Number,2484471.0
2,Afghanistan,2013,Female,Not applicable,Number,2401135.0
3,Afghanistan,2013,All genders,Not applicable,Number,5986268.0
4,Afghanistan,2012,All genders,Not applicable,Number,5767543.0

In [61]:
primary_raw["Sex"].value_counts(dropna=False)

Sex
All genders    2790
Female         2766
Name: count, dtype: int64

In [62]:
primary=primary[primary["Sex"]=="All genders"].copy()
primary.head()

,Country,Year,Sex,Age group,Units of measurement,Value
0,Afghanistan,2014,All genders,Not applicable,Number,6217756.0
3,Afghanistan,2013,All genders,Not applicable,Number,5986268.0
4,Afghanistan,2012,All genders,Not applicable,Number,5767543.0
7,Afghanistan,2011,All genders,Not applicable,Number,5291624.0
8,Afghanistan,2010,All genders,Not applicable,Number,5279326.0

In [63]:
primary=primary.drop(columns=["Sex","Age group","Units of measurement"])
primary.head()
primary.shape

(2790, 3)

In [64]:
primary=primary.dropna(subset=["Country","Year","Value"]).copy()
primary.shape

(2790, 3)

In [ ]:
primary["Country"]=primary["Country"].astype(str).str.strip() # stripping the extra space in front or bebhidn of country name

In [69]:
primary=primary.rename(columns={"Value":"Enroll_Primary"})
primary.shape

(2790, 3)

doesnt change anything as such, pretty clean data then

In [71]:
print(primary["Year"].min(),primary["Year"].max())

print("Duplicate Country-Year pairs:",primary.duplicated(subset=["Country","Year"]).sum())

1999 2015
Duplicate Country-Year pairs: 0

In [73]:
primary.to_csv("../output/primary_clean.csv", index=False)